app/views/users/userslist.html.erb


    <% @users = User.all %>
---
SELECT "users".* FROM "users"